# Taps
tap "felixkratz/formulae"
tap "homebrew/autoupdate"
tap "laishulu/homebrew"
tap "yakitrak/yakitrak"

# === Shell / Terminal ===
brew "fzf"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "starship"
brew "direnv"
brew "mise"
brew "stow"

# === File / Search ===
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "tldr"

# === Git ===
brew "git-delta"
brew "gh"
brew "ghq"
brew "lazygit"

# === Editor ===
brew "neovim"

# === Multiplexer ===
brew "tmux"

# === Docker ===
brew "colima", restart_service: :changed
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "lazydocker"

# === Dev tools ===
brew "rustup"
brew "uv"
brew "gnupg"
brew "imagemagick"
brew "plantuml"
brew "mdbook"
brew "lnav"

# === CLI utilities ===
brew "googleworkspace-cli"
brew "pkgconf"
brew "obsidian-cli", tap: "yakitrak/yakitrak"

# === macOS specific ===
brew "borders", tap: "felixkratz/formulae"
brew "macism", tap: "laishulu/homebrew"

# === Casks: Terminals & Editors ===
cask "ghostty"
cask "visual-studio-code"

# === Casks: Browsers ===
cask "arc"
cask "google-chrome"
cask "firefox"

# === Casks: Dev tools ===
cask "docker-desktop"
cask "dbeaver-community"
cask "postman"
cask "intellij-idea"
cask "hammerspoon"

# === Casks: Productivity ===
cask "obsidian"
cask "karabiner-elements"

# === Casks: Communication ===
cask "slack"
cask "discord"
cask "zoom"

# === Casks: Utilities ===
cask "applite"
cask "amical"
cask "commander-one"
cask "keyboardcleantool"

# === Fonts ===
cask "font-hackgen-nerd"

# === VS Code Extensions ===
vscode "42crunch.vscode-openapi"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "corschenzi.mermaid-graphical-editor"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eg2.vscode-npm-script"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "jasonnutter.search-node-modules"
vscode "koichisasada.vscode-rdbg"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-vscode-remote.remote-containers"
vscode "philosowaffle.openapi-designer"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "vstirbu.vscode-mermaid-preview"
vscode "waderyan.nodejs-extension-pack"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"

# === Go tools (via mise-managed Go) ===
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"

# === Cargo ===
cargo "mdbook-plantuml"
