tap "yakitrak/yakitrak"
brew "atuin"
brew "bat"
brew "chezmoi"
brew "cmake"
brew "colima", restart_service: :changed
brew "czg"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git-delta"
brew "go"
brew "googleworkspace-cli"
brew "lazydocker"
brew "lazygit"
brew "libyaml"
brew "lnav"
brew "mise"
brew "neovim"
brew "rclone"
brew "ripgrep"
brew "rustup"
brew "starship"
brew "tldr"
brew "tmux"
brew "uv"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "yakitrak/yakitrak/obsidian-cli"
cask "amical"
cask "applite"
cask "caffeine"
cask "commander-one"
cask "dbeaver-community"
cask "discord"
cask "font-hackgen-nerd"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "obsidian"
cask "postman"
cask "slack"
cask "visual-studio-code"
cask "zoom"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "mdbook-plantuml"
